mafeiGitHub/stm32Mp3/Bsp/cLcd.cpp
  ltdc.timeouts = 0;
  ltdc.lineIrq = 0;
  ltdc.fifoUnderunIrq = 0;
  ltdc.transferErrorIrq = 0;
  ltdc.lastTicks = 0;
  ltdc.lineTicks = 0;
  ltdc.frameWait = 0;

  HAL_NVIC_SetPriority (LTDC_IRQn, 0xE, 0);
  HAL_NVIC_EnableIRQ (LTDC_IRQn);

  // set line interupt line number
  LTDC->LIPCR = 0;

  // enable line interrupt
  LTDC->IER |= LTDC_IT_LI;
  }
//}}}
//{{{
void cLcd::layerInit (uint8_t layer, uint32_t frameBufferAddress) {

  LTDC_LayerCfgTypeDef* curLayerCfg = &hLtdc.LayerCfg[layer];

  curLayerCfg->WindowX0 = 0;
  curLayerCfg->WindowX1 = getWidth();
  curLayerCfg->WindowY0 = 0;
  curLayerCfg->WindowY1 = getHeight();

  curLayerCfg->PixelFormat = LTDC_PIXEL_FORMAT_ARGB8888;
  curLayerCfg->FBStartAdress = (uint32_t)frameBufferAddress;

  curLayerCfg->Alpha = 255;
  curLayerCfg->Alpha0 = 0;

  curLayerCfg->Backcolor.Blue = 0;
  curLayerCfg->Backcolor.Green = 0;
  curLayerCfg->Backcolor.Red = 0;

  curLayerCfg->BlendingFactor1 = LTDC_BLENDING_FACTOR1_PAxCA;
  curLayerCfg->BlendingFactor2 = LTDC_BLENDING_FACTOR2_PAxCA;

  curLayerCfg->ImageWidth = getWidth();
  curLayerCfg->ImageHeight = getHeight();

  HAL_LTDC_ConfigLayer (&hLtdc, curLayerCfg, layer);

  // local state
  mCurFrameBufferAddress = frameBufferAddress;
  mSetFrameBufferAddress[layer] = frameBufferAddress;
  showFrameBufferAddress[layer] = frameBufferAddress;
  showAlpha[layer] = 255;
  }
//}}}

#ifdef STM32F769I_DISCO
  //{{{
  void cLcd::dsiWriteCmd (uint32_t NbrParams, uint8_t* pParams) {

    if (NbrParams <= 1)
     HAL_DSI_ShortWrite (&hdsi_discovery, 0, DSI_DCS_SHORT_PKT_WRITE_P1, pParams[0], pParams[1]);
    else
     HAL_DSI_LongWrite (&hdsi_discovery,  0, DSI_DCS_LONG_PKT_WRITE, NbrParams, pParams[NbrParams], pParams);
    }
  //}}}
  //{{{
  void cLcd::otm8009aInit (bool landscape) {

    /* Enable CMD2 to access vendor specific commands                               */
    /* Enter in command 2 mode and set EXTC to enable address shift function (0x00) */
    dsiWriteCmd (0, (uint8_t*)ShortRegData1);
    dsiWriteCmd (3, (uint8_t*)lcdRegData1);

    /* Enter ORISE Command 2 */
    dsiWriteCmd (0, (uint8_t*)ShortRegData2); /* Shift address to 0x80 */
    dsiWriteCmd (2, (uint8_t*)lcdRegData2);

    /* SD_PCH_CTRL - 0xC480h - 129th parameter - Default 0x00          */
    /* Set SD_PT                                                       */
    /* -> Source output level during porch and non-display area to GND */
    dsiWriteCmd (0, (uint8_t*)ShortRegData2);
    dsiWriteCmd (0, (uint8_t*)ShortRegData3);
    HAL_Delay(10);

    /* Not documented */
    dsiWriteCmd (0, (uint8_t*)ShortRegData4);
    dsiWriteCmd (0, (uint8_t*)ShortRegData5);
    HAL_Delay(10);

    /* PWR_CTRL4 - 0xC4B0h - 178th parameter - Default 0xA8 */
    /* Set gvdd_en_test                                     */
    /* -> enable GVDD test mode !!!                         */
    dsiWriteCmd (0, (uint8_t*)ShortRegData6);
    dsiWriteCmd (0, (uint8_t*)ShortRegData7);

    /* PWR_CTRL2 - 0xC590h - 146th parameter - Default 0x79      */
    /* Set pump 4 vgh voltage                                    */
    /* -> from 15.0v down to 13.0v                               */
    /* Set pump 5 vgh voltage                                    */
    /* -> from -12.0v downto -9.0v                               */
    dsiWriteCmd (0, (uint8_t*)ShortRegData8);
    dsiWriteCmd (0, (uint8_t*)ShortRegData9);

    /* P_DRV_M - 0xC0B4h - 181th parameter - Default 0x00 */
    /* -> Column inversion                                */
    dsiWriteCmd (0, (uint8_t*)ShortRegData10);
    dsiWriteCmd (0, (uint8_t*)ShortRegData11);

    /* VCOMDC - 0xD900h - 1st parameter - Default 0x39h */
    /* VCOM Voltage settings                            */
    /* -> from -1.0000v downto -1.2625v                 */
    dsiWriteCmd (0, (uint8_t*)ShortRegData1);
    dsiWriteCmd (0, (uint8_t*)ShortRegData12);

    /* Oscillator adjustment for Idle/Normal mode (LPDT only) set to 65Hz (default is 60Hz) */
    dsiWriteCmd (0, (uint8_t*)ShortRegData13);
    dsiWriteCmd (0, (uint8_t*)ShortRegData14);

    /* Video mode internal */
    dsiWriteCmd (0, (uint8_t*)ShortRegData15);
    dsiWriteCmd (0, (uint8_t*)ShortRegData16);

    /* PWR_CTRL2 - 0xC590h - 147h parameter - Default 0x00 */
    /* Set pump 4&5 x6                                     */
    /* -> ONLY VALID when PUMP4_EN_ASDM_HV = "0"           */
    dsiWriteCmd (0, (uint8_t*)ShortRegData17);
    dsiWriteCmd (0, (uint8_t*)ShortRegData18);

    /* PWR_CTRL2 - 0xC590h - 150th parameter - Default 0x33h */
    /* Change pump4 clock ratio                              */
    /* -> from 1 line to 1/2 line                            */
    dsiWriteCmd (0, (uint8_t*)ShortRegData19);
    dsiWriteCmd (0, (uint8_t*)ShortRegData9);

    /* GVDD/NGVDD settings */
    dsiWriteCmd (0, (uint8_t*)ShortRegData1);
    dsiWriteCmd (2, (uint8_t*)lcdRegData5);

    /* PWR_CTRL2 - 0xC590h - 149th parameter - Default 0x33h */
    /* Rewrite the default value !                           */
    dsiWriteCmd (0, (uint8_t*)ShortRegData20);
    dsiWriteCmd (0, (uint8_t*)ShortRegData21);

    /* Panel display timing Setting 3 */
    dsiWriteCmd(0, (uint8_t*)ShortRegData22);
    dsiWriteCmd (0, (uint8_t*)ShortRegData23);

    /* Power control 1 */
    dsiWriteCmd (0, (uint8_t*)ShortRegData24);
    dsiWriteCmd (0, (uint8_t*)ShortRegData25);

    /* Source driver precharge */
    dsiWriteCmd (0, (uint8_t *)ShortRegData13);
    dsiWriteCmd (0, (uint8_t*)ShortRegData26);

    dsiWriteCmd (0, (uint8_t*)ShortRegData15);
    dsiWriteCmd (0, (uint8_t*)ShortRegData27);

    dsiWriteCmd (0, (uint8_t*)ShortRegData28);
    dsiWriteCmd (2, (uint8_t *)lcdRegData6);

    /* GOAVSt*/
    dsiWriteCmd (0, (uint8_t*)ShortRegData2);
    dsiWriteCmd (6, (uint8_t*)lcdRegData7);

    dsiWriteCmd (0, (uint8_t*)ShortRegData29);
    dsiWriteCmd (14, (uint8_t*)lcdRegData8);

    dsiWriteCmd (0, (uint8_t*)ShortRegData30);
    dsiWriteCmd (14, (uint8_t*)lcdRegData9);

    dsiWriteCmd (0, (uint8_t*)ShortRegData31);
    dsiWriteCmd (10, (uint8_t*)lcdRegData10);

    dsiWriteCmd (0, (uint8_t*)ShortRegData32);
    dsiWriteCmd (0, (uint8_t*)ShortRegData46);

    dsiWriteCmd (0, (uint8_t*)ShortRegData2);
    dsiWriteCmd (10, (uint8_t*)lcdRegData11);

